// davaleba 1
// props არის ობიექტი
// მასში ინახება მონაცემები, რომლებიც მშობელმა (Parent) კომპონენტმა გადმოგვცა
// აქ props.name ნიშნავს მშობლისგან მიღებულ name მნიშვნელობას



// davaleba 2
// props გამოიყენება მონაცემების გადასაცემად
// მშობელი კომპონენტი შვილ კომპონენტს უგზავნის მონაცემებს props-ის საშუალებით.

// props არის მხოლოდ წასაკითხი
// შვილ კომპონენტს არ შეუძლია props-ის შეცვლა.

// props გვეხმარება კომპონენტების მრავალჯერ გამოყენებაში
// ერთი და იგივე კომპონენტი სხვადასხვა მონაცემით შეგვიძლია გამოვიყენოთ.