# 1) იპოვეთ ლისტში ყველაზე პატარა წევრი min ფუნქციის გამოყენების გარეშე.
num = [1, 2, 3, 4, 5]
print(num[0])


# 2) იპოვეთ ლისტში ყველაზე დიდი წევრი max ფუნქციის გამოყენების გარეშე.
num = [1, 2, 3, 4, 5]
print(num[4])


# 3) შემოგდით სია სადაც არის მინიმუმ 6 ელემენტი და თქვენი დავალებაა გამოიტანოთ 1 - 3 და 5 წევრების ინდექსები.
num = [1, 2, 3, 4, 5, 6]
copy_num = num[0:6:2]
print(copy_num)


# 4) შემოგდით 2 სია აქედან ერთში არის მხოლოდ ინტეჯერები და მეორეში არის მხოლოდ სტრინგები. თქვენი დავალებაა გააერთიანოთ ეს ორი ლისტი ისე რომ ყოველი ინტეჯერის შემდეგ მოდიოდეს სტრინგი(ანუ თანმიმდევრობით str - int - str - int ან პირიქით).
num = [1, 2, 3, 4, 5]
string = ["nika", "luka", "gio", "deme"]
num.extend(string)
print(num)


# 5) შემოგდით სია სადაც არის სტრინგები და ინტეჯერები. თქვენი დავალებაა ამ სიიდან ამოიღოთ თოეული წევრი და ინტეჯერები მოატავსოთ ცალკე სიაში ხოლო სტრინგები ცალკე სიაში.
name = ["nika", 1, "gio", 5]
print(name[0:4:2])
print(name[1:4:2])


# 6) შემოგდით 4 სია და თქვენი დავალებაა ამ ორი სიიდან ამოიღოთ კენტები და ლუწები და დაპრინტოთ მათი ჯამი ცალ-ცალკე.
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]

even = []
odd = []

for i in num:
    if i % 2 == 0:
        even.append(i)
    else:
        odd.append(i)

for i in num:
 if i % 2 == 0:
    even.append(i)
else:
    odd.append(i)

for i in num:
    if i % 2 == 0:
        even.append(i)
    else:
        odd.append(i)

for i in num:
    if i % 2 == 0:
        even.append(i)
    else:
        odd.append(i)

print(sum(even))
print(sum(odd))


# 7) შემოგდით 4 სია და თქვენი დავალებაა ამ სიებიდან ამოიღოთ კენტები და ლუწები და განათავსოთ ისინი ორ სხვადასხვა სიაში.
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]
num = [1, 2, 3, 4, 5, 6]

even = []
odd = []

for i in num:
    if i % 2 == 0:
        even.append(i)
    else:
        odd.append(i)



# 8) შემოგდით სია სადაც არის მხოლოდ სტრინგები და თქვენ გევალებათ გაიგოთ ყველა ამ ელემენტების სიგრძე შეიყვანოთ მეორე სიაში(იგივე თანმიმდევრობით).
string = ["nika", "luka", "gio", "deme"]
string = []
for i in string:
    length = len(i)
    string.append(length)
print(length)


# 9) შემოგდით რამდენიმე სია (სტრინგებიც და ინტეჯერებიც) თქვენი დავალებაა ყველა ინტეჯერი შეკრიბოთ და ყველა სტრინგი შეაერთოთ.
string = ["nika", "luka", 5, 6, 7, 8]
string = ""
number = 0
for i in string:
    if type(i) == str:
        string  += i
    elif type(i) == int:
     number += i

print(string)
print(number)


# 10) შემოგდით სია თქვენი ადვალებაა ამ სიიდან ლუწ ინდექსე მყოფი ელემენტები გადაიტანოთ ახალ სიაში საბოლოოდ კი გამოიტანოთ ტერმინალში.
num = [1, 2, 3, 4, 5, 6]
print(num[1:7:2])