// davaleba 1
// useState არის React-ის Hook, რომელიც საშუალებას გაძლევს ფუნქციურ კომპონენტში გამოიყენო—
//  ანუ მონაცემები, რომლებიც დროსთან ერთად იცვლება და ხელახლა რენდერს იწვევს.
// useState → ინახავს მნიშვნელობას + გაძლევს ფუნქციას მისი შესაცვლელად.



// davaleba 2
// განსხვავება useState და ჩვეულებრივ ცვლადს შორის
// 1) useState –
// მნიშვნელობის შეცვლისას კომპონენტი თავიდან რენდერდება
// ცვლილება ინახება კომპონენტის სიცოცხლის განმავლობაში
// React აკონტროლებს ამ მნიშვნელობას
// ასინქრონულად მუშაობს და UI-სთანაა დაკავშირებული

// 2) ჩვეულებრივი ცვლადი
// მნიშვნელობის შეცვლა არ გამოიწვევს კომპონენტის გადაიხატვას
// ყოველი რენდერისას ხელახლა იქმნება
// React არ ამოწმებს მის მნიშვნელობას
// UI არ იცვლება