// davaleba 1
// JSON (JavaScript Object Notation) არის მონაცემთა გაცვლის მსუბუქი ფორმატი
// გამოიყენება სერვერსა და მომხმარებელს შორის ინფორმაციის გადასაცემად
// ადვილად იკითხება როგორც ადამიანისთვის, ასევე კომპიუტერისთვის
// ძირითადად მუშაობს წყვილებით: "key": "value"
// JSON გამოიყენება API-ებში მონაცემების წასაღებად ან გასაგზავნად




// davaleba 3
// სერვერიდან წამოღებული JSON ინფორმაცია მოდის ტექსტის სახით
// JS-ში მას გარდავქმნით ობიექტად ან მასივად JSON.parse()-ით
let jsonText = '{"name":"Nika","age":20}'; // სტრინგის სახით
let obj = JSON.parse(jsonText); // JS ობიექტად გარდაქმნა
console.log(obj.name); // "Nika"
