// 1
// Encoding არის მონაცემების ერთი ფორმატიდან მეორეში გადაყვანის პროცესი,
//  რათა ინფორმაცია სწორად გადაიცეს ან შეინახოს სხვადასხვა სისტემაში.




// 2
// Encryption არის ინფორმაციის დაშიფვრის პროცესი, რომლის დროსაც ჩვეულებრივი ტექსტი (Plain Text)
//  გარდაიქმნება დაშიფრულ ტექსტად (Cipher Text).
// მისი გაშიფვრა შესაძლებელია მხოლოდ შესაბამისი გასაღებით (Key).
// გამოიყენება:
// პაროლების უსაფრთხო გადაცემისთვის
// ონლაინ ბანკინგში
// HTTPS კავშირებში
// კონფიდენციალური მონაცემების დასაცავად
// Encryption-ის მთავარი მიზანია ინფორმაციის დაცვა არაავტორიზებული წვდომისგან.





// 3
// Hashing არის პროცესია, რომელიც ნებისმიერ მონაცემს გარდაქმნის ფიქსირებული სიგრძის უნიკალურ მნიშვნელობად (Hash).
// Hashing-ის უკან დაბრუნება შეუძლებელია.
// პაროლების შესანახად გამოიყენება იმიტომ, რომ:
// რეალური პაროლი მონაცემთა ბაზაში არ ინახება.
// მონაცემთა ბაზის გატეხვის შემთხვევაშიც პაროლების აღდგენა ძალიან რთულია.
// მომხმარებლის შეყვანილი პაროლი ხელახლა იჰეშება და მიღებული Hash შედარდება შენახულ Hash-ს.






// 4
// მახასიათებელი	Encoding	                  Encryption	                    Hashing
// მთავარი მიზანი	მონაცემის ფორმატის შეცვლა	ინფორმაციის დაცვა	მონაცემის უნიკალური ანაბეჭდის შექმნა
// შესაძლებელია დაბრუნება?	დიახ	დიახ (გასაღებით)	არა
// იყენებს გასაღებს?	არა	დიახ	არა
// უსაფრთხოებისთვის გამოიყენება?	არა	დიახ	დიახ
// მაგალითი	Base64	AES, RSA	SHA-256, MD5





// 5
// Encoding
// მონაცემების წარმოდგენა ან გადაცემა ისეთი ფორმით, რომელიც სხვადასხვა სისტემას ესმის.

// Encryption
// მონაცემების დაცვა და არაავტორიზებული წვდომისგან ინფორმაციის დამალვა.

// Hashing
// მონაცემების უნიკალური ანაბეჭდის შექმნა და პაროლების უსაფრთხოდ შენახვა.